{
  "project": "2000nl",
  "branchName": "ralph/pwa-and-polish",
  "description": "PWA + Polish - Enable PWA installation with app icon and fullscreen mode, evaluate desktop card width, and achieve WCAG AA color accessibility compliance",
  "userStories": [
    {
      "id": "US-032",
      "title": "PWA Support - Icon + Fullscreen",
      "description": "As a mobile user, I want to install 2000nl to my home screen and use it in fullscreen mode so that I have an app-like experience without browser chrome. Offline functionality is explicitly out of scope - when offline, the app shows 'Please connect' message.",
      "acceptanceCriteria": [
        "Create manifest.json with app metadata (name, short_name, description, start_url, display: standalone, theme_color, background_color, icons)",
        "Generate icon assets: 192x192, 512x512 (Android), 180x180 (Apple touch icon)",
        "Add manifest link to apps/ui/app/layout.tsx",
        "Add meta tags: theme-color, mobile-web-app-capable, apple-mobile-web-app-capable, apple-mobile-web-app-status-bar-style, apple-mobile-web-app-title",
        "Add offline detection banner with message: You're offline. Please connect to continue",
        "Test installation on iOS Safari (Add to Home Screen)",
        "Test installation on Android Chrome (Install app prompt)",
        "Test installation on desktop Chrome/Edge",
        "Verify app opens in standalone/fullscreen mode (no browser UI)",
        "App icon appears correctly on home screen",
        "Lighthouse PWA installability checks pass",
        "Screenshots showing: install prompt, home screen icon, fullscreen mode",
        "Typecheck passes: npx tsc --noEmit",
        "Verify in browser using Chrome DevTools MCP"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-045",
      "title": "Desktop Card Width Evaluation",
      "description": "As a developer, I want to evaluate whether desktop cards should expand width when text doesn't fit (like mobile) or maintain fixed width with scrolling, so that we choose the approach with best readability and user experience.",
      "acceptanceCriteria": [
        "Use Chrome DevTools MCP to test current fixed-width behavior with long content",
        "Measure current line length in characters",
        "Screenshot current behavior showing scrolling with long content",
        "Temporarily test expansion approach (modify width classes)",
        "Screenshot expanded behavior",
        "Measure line length in expanded approach",
        "Research typography best practices for optimal line length (50-75 characters)",
        "Document pros/cons of both approaches",
        "Make decision: fixed width, expand with max-width, or full expansion",
        "Document decision with clear reasoning in progress notes",
        "If implementing change: Update card width classes in TrainingCard.tsx",
        "If implementing change: Test on multiple desktop viewports (1280px, 1440px, 1920px)",
        "If implementing change: Verify no horizontal scroll on standard viewports",
        "If implementing change: Verify line length within optimal range",
        "Screenshots documenting comparison and final decision",
        "Typecheck passes: npx tsc --noEmit",
        "Verify in browser using Chrome DevTools MCP"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-052",
      "title": "Color Accessibility Improvements",
      "description": "As a user with visual impairments or color-blindness, I want the app to meet WCAG AA accessibility standards so that I can effectively use all features regardless of my vision capabilities.",
      "acceptanceCriteria": [
        "Read Tailwind config and extract all colors with hex values",
        "Document all color usage contexts (primary, secondary, background, text, badges, buttons, etc.)",
        "Map all text/background color combinations used in app",
        "Calculate contrast ratios for all combinations using WebAIM Contrast Checker",
        "Create matrix of failing combinations (those below 4.5:1 for normal text or 3:1 for large text)",
        "Generate alternative colors for failing pairs using Tanaguru Contrast-Finder",
        "Test color scheme with color-blindness simulators (protanopia, deuteranopia, tritanopia, achromatopsia)",
        "Verify semantic colors remain distinguishable (success vs error vs warning)",
        "Update Tailwind config with WCAG AA compliant colors",
        "Preserve brand identity by adjusting saturation/lightness, not hue",
        "Test changes in browser using Chrome DevTools MCP",
        "Screenshot before/after comparisons of key components",
        "Visual regression testing on cards, navbar, buttons, badges",
        "Run Lighthouse accessibility audit",
        "Lighthouse accessibility score > 90",
        "Document color usage guidelines in apps/ui/docs/accessibility-colors.md",
        "All text meets 4.5:1 contrast ratio (normal text) or 3:1 (large text ≥18pt)",
        "No visual regressions or unexpected color changes",
        "Typecheck passes: npx tsc --noEmit",
        "Verify in browser using Chrome DevTools MCP"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    }
  ]
}
