{
  "project": "2000nl",
  "branchName": "ralph/typography-reading-experience",
  "description": "Typography & Reading Experience - Establish clear visual hierarchy through line spacing, evaluate desktop card width behavior, and audit color accessibility for WCAG AA compliance",
  "userStories": [
    {
      "id": "US-033",
      "title": "Line Spacing - Soft Wraps vs Sentences",
      "description": "As a learner, I want clear visual hierarchy in text spacing so that I can easily distinguish between line wraps within sentences, source-to-translation groupings, and separate sentences/examples.",
      "acceptanceCriteria": [
        "Wrapped lines within one sentence have tight line-height (~1.4)",
        "Translations tightly grouped with source text (small gap, ~0.25rem)",
        "Spacing between different sentences/examples clearly larger (~1.2-1.5em)",
        "Visual hierarchy shows which translation belongs to which source",
        "No ambiguity about sentence boundaries",
        "Works on both mobile and desktop viewports",
        "Screenshots show before/after comparison with annotations",
        "Test with various content: short sentences, long wrapped sentences, multiple examples, with/without translations",
        "Typecheck passes: npx tsc --noEmit",
        "Verify in browser using Chrome DevTools MCP"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-045",
      "title": "Desktop Card Width Expansion for Long Content",
      "description": "As a user, I want desktop cards to handle long content appropriately so that I can read efficiently without excessive scrolling or readability issues from overly wide lines.",
      "acceptanceCriteria": [
        "Evaluate both approaches (fixed width + scrolling vs expansion) with real content using Chrome DevTools MCP",
        "Take screenshots of both behaviors",
        "Consider typography principles (optimal line length: 50-75 chars)",
        "Document decision with reasoning",
        "If implementing change: Update card width classes",
        "If implementing change: Test on various desktop viewport sizes",
        "If implementing change: Verify no horizontal scroll on standard viewports",
        "Document decision in progress notes",
        "Typecheck passes: npx tsc --noEmit"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-052",
      "title": "Color Accessibility Improvements",
      "description": "As a user with visual impairments or color-blindness, I want the app to meet WCAG AA accessibility standards so that I can effectively use all features regardless of my vision capabilities.",
      "acceptanceCriteria": [
        "All app colors documented with hex values and usage",
        "Contrast ratios calculated for all text/background pairs",
        "Failing combinations identified with specific locations",
        "Alternative colors suggested for non-compliant pairs",
        "Color-blindness simulation performed (protanopia, deuteranopia, tritanopia, achromatopsia)",
        "WCAG AA compliance achieved for all text (4.5:1 normal, 3:1 large)",
        "Updated color tokens implemented in config",
        "Screenshots show before/after comparison",
        "Visual regression testing on key components (cards, navbar, buttons, badges)",
        "Accessibility guidelines documented",
        "Lighthouse accessibility score > 90",
        "Typecheck passes: npx tsc --noEmit",
        "Verify in browser using Chrome DevTools MCP"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    }
  ]
}
