{
  "project": "2000nl",
  "branchName": "ralph/pre-launch-polish",
  "description": "Pre-Launch Polish & Internationalization - Fix visual issues and add multi-language onboarding for external beta launch",
  "userStories": [
    {
      "id": "US-056",
      "title": "Fix Theme Toggle Icon Position",
      "description": "Dark/light theme toggle icon appears in the wrong position (top left corner) instead of its intended location in the header toolbar. This is a regression from previous work and needs immediate fix.",
      "acceptanceCriteria": [
        "Locate theme toggle component in codebase",
        "Move icon to correct header position (top right with settings/controls)",
        "Verify position on mobile viewport (375px width)",
        "Verify position on desktop viewport (1280px+ width)",
        "Check for CSS conflicts or layout issues",
        "Take screenshot showing correct placement in both viewports",
        "Run typecheck: npx tsc --noEmit from apps/ui/ (must pass)",
        "Verify in browser using Chrome DevTools MCP"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-060",
      "title": "Dark Mode Styling for Onboarding Tour",
      "description": "When app is in dark mode, the React Joyride onboarding tour displays tooltips with light theme styling, creating poor contrast and inconsistent visual experience.",
      "acceptanceCriteria": [
        "Detect current theme (light/dark) in OnboardingTour component",
        "Apply theme-appropriate colors to Joyride tooltips using custom styles",
        "Test tour in light mode: verify light tooltips render correctly",
        "Test tour in dark mode: verify dark tooltips render correctly",
        "Verify contrast ratios meet accessibility standards (WCAG AA)",
        "Optional: Test theme toggle during active tour (edge case)",
        "Take screenshots showing both light and dark tour appearances",
        "Run typecheck: npx tsc --noEmit from apps/ui/ (must pass)",
        "Verify in browser using Chrome DevTools MCP"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-064",
      "title": "Fix Example Pipe Color Consistency",
      "description": "Vertical pipes (border-left indicators) next to example sentences have inconsistent colors and low visibility. First pipe appears darker than subsequent pipes, and some pipes have different colors from text.",
      "acceptanceCriteria": [
        "Standardize pipe color across all examples using theme variable",
        "Ensure all pipes use same border-width",
        "Remove any first-child styling causing inconsistency",
        "Verify visibility in light mode",
        "Verify visibility in dark mode",
        "Test on both mobile and desktop viewports",
        "Run typecheck: npx tsc --noEmit from apps/ui/ (must pass)",
        "Verify in browser using Chrome DevTools MCP"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-066",
      "title": "Multi-Language Onboarding Selection",
      "description": "Add native language selection as the first step of onboarding. Currently, onboarding runs in Dutch, which non-Dutch speakers cannot understand. Before showing the tutorial, users must select their preferred language (English, Russian, or Dutch).",
      "acceptanceCriteria": [
        "Create language selection component/modal",
        "Offer exactly 3 languages: English, Russian, Dutch",
        "Create translation files: locales/en.json, locales/ru.json, locales/nl.json",
        "Translate all onboarding copy into EN, RU, NL",
        "Store selected language in localStorage (key: onboarding_language)",
        "Load correct translation file based on selection",
        "Pass locale to Joyride for tutorial text",
        "Skip/dismiss option defaults to English",
        "Language preference persists across sessions",
        "Add language selector to Settings page for changing later",
        "All three languages have complete onboarding translations (no missing keys)",
        "Run typecheck: npx tsc --noEmit from apps/ui/ (must pass)",
        "Verify in browser using Chrome DevTools MCP: test all 3 languages"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    }
  ]
}
