{
  "sprintName": "Prefetch Race Condition Fix",
  "branchName": "ralph/prefetch-race-fix",
  "stories": [
    {
      "id": "US-094.1",
      "title": "Session-level reviewed-words tracking",
      "description": "Add a useRef<Set<string>> to TrainingScreen that tracks all word IDs reviewed in the current training session. In handleAction, add the current word's ID to the set BEFORE presenting the prefetched card (before the prefetch presentation block around line 1053). Clear the set on session boundary changes (list selection change, mode change, or component unmount).",
      "acceptance": [
        "reviewedInSessionRef is initialized as empty Set<string> on mount",
        "In handleAction, the current word's ID is added to the set BEFORE presenting the prefetched card",
        "The set is cleared when session boundaries change (list selection change, mode change, or component unmount)",
        "Typecheck passes"
      ],
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-094.2",
      "title": "Exclude reviewed words from prefetch",
      "description": "Update the prefetch useEffect (around line 956) to pass all session-reviewed word IDs in the exclude list: [...reviewedInSessionRef.current, forWordId]. Also update the fallback loadNextWord call (around line 1252) to pass [...reviewedInSessionRef.current, currentWord.id]. This prevents get_next_word RPC from returning any card already reviewed this session, closing the race window between prefetch and recordReview DB commits.",
      "acceptance": [
        "Prefetch passes [...reviewedInSessionRef.current, forWordId] as exclude list",
        "Fallback loadNextWord call passes [...reviewedInSessionRef.current, currentWord.id]",
        "Prefetch still works for instant transitions (no user-visible delay)",
        "Typecheck passes",
        "Verify in browser using Chrome DevTools MCP"
      ],
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-094.3",
      "title": "Regression tests for prefetch race condition",
      "description": "Add test coverage in apps/ui/tests/TrainingScreen.test.tsx ensuring that a word reviewed in the current session cannot be returned by the prefetch or on-demand fetch. Test that after grading a card, the next prefetch exclude list includes the graded card's ID. Test that after grading multiple cards, all graded IDs are in the exclude list. Test that the session-reviewed set is cleared on list/mode change. Ensure existing Sprint 17 regression tests still pass.",
      "acceptance": [
        "Test: after grading a card, the next prefetch exclude list includes the graded card's ID",
        "Test: after grading multiple cards, all graded IDs are in the exclude list",
        "Test: session-reviewed set is cleared on list/mode change",
        "Existing Sprint 17 regression tests still pass",
        "Typecheck passes",
        "All tests pass (npx vitest run)"
      ],
      "passes": true,
      "notes": ""
    }
  ]
}
